Autodesk.Revit.DB.Structure.ConnectionInputPoint.Point
3d position of this input point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor(Autodesk.Revit.DB.XYZ)
Construct an input point from 3d point. A new valid id will be auto-generated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor(Autodesk.Revit.DB.XYZ,System.Guid)
Construct an input point from 3d point and id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021